package com.xuxueli.poi.excel.test;

import com.xuxueli.poi.excel.ExcelExportUtil;
import com.xuxueli.poi.excel.ExcelImportUtil;
import com.xuxueli.poi.excel.test.model.ShopDTO;
import com.xuxueli.poi.excel.test.model.TestDTO;

import java.util.ArrayList;
import java.util.Date;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

/**
 * FUN Test
 *
 * @author xuxueli 2017-09-08 22:41:19
 */
public class Test {

    public static void main(String[] args) {

        /**
         * Mock数据，Java对象列表
         *//*
        List<ShopDTO> shopDTOList = new ArrayList<ShopDTO>();
        for (int i = 0; i < 100; i++) {
            ShopDTO shop = new ShopDTO(true, "商户"+i, (short) i, 1000+i, 10000+i, (float) (1000+i), (double) (10000+i), new Date());
            shopDTOList.add(shop);
        }
        String filePath = "/Users/xuxueli/Downloads/demo-sheet.xls";

        *//**
         * Excel导出：Object 转换为 Excel
         *//*
        ExcelExportUtil.exportToFile(filePath, shopDTOList);

        *//**
         * Excel导入：Excel 转换为 Object
          *//*
        List<Object> list = ExcelImportUtil.importExcel(filePath, ShopDTO.class);

        System.out.println(list);*/
        
        /*String lineStr="1005-苏州中环内任意点到上海虹桥机场;1006-苏州中环内任意点到上海浦东机场;1007-苏州太湖02到上海虹桥机场;1008-苏州太湖03到上海虹桥机场;1009-苏州太湖01到上海虹桥机场;1010-吴江市区01到上海虹桥机场;1011-吴江市区02到上海虹桥机场;1012-苏州太湖04到上海虹桥机场;1013-吴江市区04到上海虹桥机场;1014-吴江市区05到上海虹桥机场;1015-吴江市区03到上海虹桥机场;1016-苏州光福01到上海虹桥机场;1017-苏州光福02到上海虹桥机场;1018-吴江市区06到上海虹桥机场;1019-苏州光福04到上海虹桥机场;1020-苏州光福07到上海虹桥机场;1021-苏州光福03到上海虹桥机场;1022-苏州光福06到上海虹桥机场;1023-苏州阳澄湖02到上海虹桥机场;1024-苏州光福05到上海虹桥机场;1025-苏州阳澄湖01到上海虹桥机场;1026-苏州太湖01到上海浦东机场;1027-苏州光福08到上海虹桥机场;1028-苏州太湖03到上海浦东机场;1029-苏州太湖04到上海浦东机场;1030-苏州阳澄湖03到上海虹桥机场;1031-吴江市区02到上海浦东机场;1032-吴江市区03到上海浦东机场;1033-苏州太湖02到上海浦东机场;1034-吴江市区05到上海浦东机场;1035-吴江市区06到上海浦东机场;1036-吴江市区01到上海浦东机场;1037-苏州光福02到上海浦东机场;1038-苏州光福03到上海浦东机场;1039-吴江市区04到上海浦东机场;1040-苏州光福05到上海浦东机场;1041-苏州光福06到上海浦东机场;1042-苏州光福01到上海浦东机场;1043-苏州光福08到上海浦东机场;1044-苏州阳澄湖01到上海浦东机场;1045-苏州光福04到上海浦东机场;1046-苏州阳澄湖03到上海浦东机场;1047-甪直01到上海虹桥机场;1048-苏州光福07到上海浦东机场;1049-昆山中环内到上海虹桥机场;1050-昆山01到上海虹桥机场;1051-苏州阳澄湖02到上海浦东机场;1052-太仓01到上海虹桥机场;1053-甪直01到上海浦东机场;1054-甪直02到上海虹桥机场;1055-昆山中环内到上海浦东机场;1056-昆山01到上海浦东机场;1057-太仓市区到上海虹桥机场;1058-太仓01到上海浦东机场;1059-无锡市区01到苏州中环内;1060-甪直02到上海浦东机场;1061-苏州中环内到苏南硕放机场;1062-苏州中环内任意点到上海虹桥机场;1063-太仓市区到上海浦东机场;1064-苏州中环内任意点到上海浦东机场;1065-上海浦东机场到苏州中环内任意点;1066-无锡市区02到苏州中环内;1067-上海虹桥机场到苏州太湖02;1068-苏州太湖03到上海虹桥机场;1069-上海虹桥机场到苏州中环内任意点;1070-苏州太湖01到上海虹桥机场;1071-上海虹桥机场到苏州太湖01;1072-苏州太湖02到上海虹桥机场;1073-上海虹桥机场到吴江市区01;1074-吴江市区02到上海虹桥机场;1075-上海虹桥机场到苏州太湖03;1076-苏州太湖04到上海虹桥机场;1077-上海虹桥机场到苏州太湖04;1078-吴江市区01到上海虹桥机场;1079-上海虹桥机场到吴江市区04;1080-吴江市区05到上海虹桥机场;1081-上海虹桥机场到吴江市区02;1082-吴江市区03到上海虹桥机场;1083-上海虹桥机场到吴江市区03;1084-吴江市区04到上海虹桥机场;1085-上海虹桥机场到苏州光福01;1086-苏州光福02到上海虹桥机场;1087-上海虹桥机场到吴江市区05;1088-吴江市区06到上海虹桥机场;1089-上海虹桥机场到吴江市区06;1090-苏州光福01到上海虹桥机场;1091-上海虹桥机场到苏州光福04;1092-苏州光福07到上海虹桥机场;1093-上海虹桥机场到苏州光福02;1094-苏州光福03到上海虹桥机场;1095-上海虹桥机场到苏州光福03;1096-苏州光福04到上海虹桥机场;1097-上海虹桥机场到苏州光福06;1098-苏州阳澄湖02到上海虹桥机场;1099-上海虹桥机场到苏州光福07;1100-苏州光福05到上海虹桥机场;1101-上海虹桥机场到苏州光福05;1102-苏州光福06到上海虹桥机场;1103-上海虹桥机场到苏州阳澄湖01;1104-苏州太湖01到上海浦东机场;1105-上海虹桥机场到苏州阳澄湖02;1106-苏州光福08到上海虹桥机场;1107-上海虹桥机场到苏州光福08;1108-苏州阳澄湖01到上海虹桥机场;1109-上海浦东机场到苏州太湖03;1110-苏州太湖04到上海浦东机场;1111-上海浦东机场到苏州太湖01;1112-苏州阳澄湖03到上海虹桥机场;1113-上海虹桥机场到苏州阳澄湖03;1114-苏州太湖03到上海浦东机场;1115-上海浦东机场到吴江市区02;1116-吴江市区03到上海浦东机场;1117-上海浦东机场到苏州太湖04;1118-苏州太湖02到上海浦东机场;1119-上海浦东机场到苏州太湖02;1120-吴江市区02到上海浦东机场;1121-上海浦东机场到吴江市区05;1122-吴江市区06到上海浦东机场;1123-上海浦东机场到吴江市区03;1124-吴江市区01到上海浦东机场;1125-上海浦东机场到吴江市区01;1126-吴江市区05到上海浦东机场;1127-上海浦东机场到苏州光福02;1128-苏州光福03到上海浦东机场;1129-上海浦东机场到吴江市区06;1130-吴江市区04到上海浦东机场;1131-上海浦东机场到吴江市区04;1132-苏州光福02到上海浦东机场;1133-上海浦东机场到苏州光福05;1134-苏州光福06到上海浦东机场;1135-上海浦东机场到苏州光福03;1136-苏州光福01到上海浦东机场;1137-上海浦东机场到苏州光福01;1138-苏州光福05到上海浦东机场;1139-上海浦东机场到苏州光福08;1140-苏州阳澄湖01到上海浦东机场;1141-上海浦东机场到苏州光福06;1142-苏州光福04到上海浦东机场;1143-上海浦东机场到苏州光福04;1144-苏州光福08到上海浦东机场;1145-上海浦东机场到苏州阳澄湖03;1146-甪直01到上海虹桥机场;1147-上海浦东机场到苏州阳澄湖01;1148-苏州光福07到上海浦东机场;1149-上海浦东机场到苏州光福07;1150-苏州阳澄湖03到上海浦东机场;1151-上海虹桥机场到昆山中环内;1152-昆山01到上海虹桥机场;1153-上海虹桥机场到甪直01;1154-苏州阳澄湖02到上海浦东机场;1155-上海浦东机场到苏州阳澄湖02;1156-昆山中环内到上海虹桥机场;1157-上海虹桥机场到太仓01;1158-甪直01到上海浦东机场;1159-上海虹桥机场到昆山01;1160-甪直02到上海虹桥机场;1161-上海虹桥机场到甪直02;1162-太仓01到上海虹桥机场;1163-上海浦东机场到昆山中环内;1164-昆山01到上海浦东机场;1165-上海浦东机场到甪直01;1166-太仓市区到上海虹桥机场;1167-上海虹桥机场到太仓市区;1168-昆山中环内到上海浦东机场;1169-上海浦东机场到太仓01;1170-无锡市区01到苏州中环内;1171-上海浦东机场到昆山01;1172-甪直02到上海浦东机场;1173-上海浦东机场到甪直02;1174-太仓01到上海浦东机场;1175-苏南硕放机场到苏州中环内;1176-太仓市区到上海浦东机场;1177-苏州中环内到无锡市区01;1178-无锡市区02到苏州中环内;1179-苏州中环内到无锡市区02;1180-苏州中环内到苏南硕放机场;1182-苏州中环内到上海虹桥机场（跨城）;1183-上海浦东机场到太仓市区;1184-苏州中环内到上海浦东机场（跨城）;1185-苏州中环内到上海虹桥火车站（跨城）;1187-上海虹桥机场到苏州中环内（跨城）;1188-上海虹桥火车站到苏州中环内（接送站）;1189-上海浦东机场到苏州中环内（跨城）;1190-上海虹桥火车站到苏州中环内（跨城）;1191-苏州中环内到上海浦东机场T1航站楼（接送站）;1192-苏州中环内到上海虹桥火车站（接送站）;1193-苏州中环内到上海虹桥机场T1航站楼（接送站）;1194-苏州中环内到上海浦东机场T2航站楼（接送站）;1195-上海虹桥机场T1航站楼到苏州中环内（接送站）;1196-苏州中环内到上海虹桥机场T2航站楼（接送站）;1197-上海吴淞口码头到苏州中环内任意点;1198-上海虹桥机场T2航站楼到苏州中环内（接送站）;1199-上海浦东机场T1航站楼到苏州中环内（接送站）;1200-苏州太湖01到上海吴淞口码头;1201-苏州中环内任意点到上海吴淞口码头;1202-上海浦东机场T2航站楼到苏州中环内（接送站）;1203-苏州太湖04到上海吴淞口码头;1204-上海吴淞口码头到苏州太湖02;1205-上海吴淞口码头到苏州太湖01;1206-吴江市区01到上海吴淞口码头;1207-上海吴淞口码头到苏州太湖03;1208-苏州太湖02到上海吴淞口码头;1209-上海吴淞口码头到吴江市区03;1210-上海吴淞口码头到吴江市区02;1211-苏州太湖03到上海吴淞口码头;1212-吴江市区04到上海吴淞口码头;1213-吴江市区03到上海吴淞口码头;1214-上海吴淞口码头到苏州太湖04;1215-吴江市区05到上海吴淞口码头;1216-上海吴淞口码头到吴江市区06;1217-上海吴淞口码头到吴江市区01;1218-上海吴淞口码头到苏州光福03;1219-上海吴淞口码头到苏州光福01;1220-吴江市区02到上海吴淞口码头;1221-上海吴淞口码头到苏州光福07;1222-上海吴淞口码头到苏州光福02;1223-上海吴淞口码头到吴江市区04;1224-苏州光福08到上海吴淞口码头;1225-苏州光福03到上海吴淞口码头;1226-上海吴淞口码头到吴江市区05;1227-苏州阳澄湖02到上海吴淞口码头;1228-苏州光福04到上海吴淞口码头;1229-吴江市区06到上海吴淞口码头;1230-苏州阳澄湖03到上海吴淞口码头;1231-上海吴淞口码头到苏州光福05;1232-苏州光福01到上海吴淞口码头;1233-甪直01到上海吴淞口码头;1234-上海吴淞口码头到苏州光福06;1235-苏州光福02到上海吴淞口码头;1236-甪直02到上海吴淞口码头;1237-苏州光福07到上海吴淞口码头;1238-上海吴淞口码头到苏州光福04;1239-昆山01到上海吴淞口码头;1240-上海吴淞口码头到苏州阳澄湖01;1241-苏州光福05到上海吴淞口码头;1242-上海虹桥机场到苏州通安01;1243-上海吴淞口码头到苏州阳澄湖02;1244-苏州光福06到上海吴淞口码头;1245-苏州太湖01到苏南硕放机场;1246-上海吴淞口码头到昆山中环内;1247-上海吴淞口码头到苏州光福08;1248-苏南硕放机场到苏州太湖02;1249-苏州通安01到上海虹桥机场;1250-苏州阳澄湖01到上海吴淞口码头;1251-苏南硕放机场到苏州太湖03;1252-上海虹桥机场到苏州通安02;1253-上海吴淞口码头到苏州阳澄湖03;1254-苏州太湖04到苏南硕放机场;1255-上海浦东机场到苏州通安01;1256-上海吴淞口码头到甪直01;1257-苏南硕放机场到吴江市区01;1258-上海浦东机场到苏州通安02;1259-上海吴淞口码头到甪直02;1260-吴江市区04到苏南硕放机场;1261-苏州太湖02到苏南硕放机场;1262-昆山中环内到上海吴淞口码头;1263-苏南硕放机场到吴江市区05;1264-苏州太湖03到苏南硕放机场;1265-上海吴淞口码头到昆山01;1266-苏南硕放机场到吴江市区06;1267-吴江市区01到苏南硕放机场;1268-苏州通安02到上海虹桥机场;1269-吴江市区07到苏南硕放机场;1270-苏南硕放机场到吴江市区02;1271-苏州通安01到上海浦东机场;1272-苏南硕放机场到苏州光福01;1273-苏南硕放机场到吴江市区03;1274-苏州通安02到上海浦东机场;1275-苏州光福02到苏南硕放机场;1276-吴江市区05到苏南硕放机场;1277-苏南硕放机场到苏州太湖01;1278-苏州光福03到苏南硕放机场;1279-吴江市区06到苏南硕放机场;1280-苏南硕放机场到苏州太湖04;1281-苏南硕放机场到苏州光福06;1282-苏州光福01到苏南硕放机场;1283-吴江市区02到苏南硕放机场;1284-苏州光福07到苏南硕放机场;1285-苏南硕放机场到苏州光福04;1286-吴江市区03到苏南硕放机场;1287-苏南硕放机场到苏州光福08;1288-苏南硕放机场到苏州光福05;1289-苏南硕放机场到吴江市区04;1290-苏南硕放机场到苏州阳澄湖02;1291-苏州光福06到苏南硕放机场;1292-苏南硕放机场到吴江市区07;1293-苏南硕放机场到苏州阳澄湖03;1294-苏州光福08到苏南硕放机场;1295-苏南硕放机场到苏州光福02;1296-甪直01到苏南硕放机场;1297-苏南硕放机场到苏州阳澄湖01;1298-苏南硕放机场到苏州光福03;1299-甪直02到苏南硕放机场;1300-苏州阳澄湖02到苏南硕放机场;1301-苏州光福04到苏南硕放机场;1302-甪直03到苏南硕放机场;1303-苏州阳澄湖03到苏南硕放机场;1304-苏州光福05到苏南硕放机场;1305-上海虹桥机场到苏州黄埭;1306-上海虹桥机场到苏州望亭;1307-苏南硕放机场到苏州光福07;1308-上海虹桥机场到苏州越溪;1309-苏州黄埭到上海虹桥机场;1310-苏州阳澄湖01到苏南硕放机场;1311-上海虹桥机场到苏州横扇镇;1312-上海虹桥机场到苏州渭塘;1313-苏南硕放机场到甪直01;1314-上海虹桥机场到甪直03;1315-苏州越溪到上海虹桥机场;1316-苏南硕放机场到甪直02;1317-上海虹桥机场到昆山03;1318-苏州横扇镇到上海虹桥机场;1319-苏南硕放机场到甪直03;1320-苏州平望到上海虹桥机场;1321-上海虹桥机场到苏州吴江市区07;1322-苏州望亭到上海虹桥机场;1323-苏州盛泽到上海虹桥机场;1324-甪直03到上海虹桥机场;1325-苏州渭塘到上海虹桥机场;1326-苏州黎里到上海虹桥机场;1327-上海虹桥机场到昆山02;1328-吴江市区07到上海虹桥机场;1329-常熟三环内到上海虹桥机场;1330-昆山03到上海虹桥机场;1331-昆山02到上海虹桥机场;1332-苏州望亭到上海浦东机场;1333-上海虹桥机场到昆山花桥;1334-昆山花桥到上海虹桥机场;1335-上海浦东机场到苏州黄埭;1336-苏州黄埭到上海浦东机场;1337-上海虹桥机场到苏州平望;1338-上海浦东机场到苏州渭塘;1339-苏州渭塘到上海浦东机场;1340-上海虹桥机场到苏州盛泽;1341-上海浦东机场到苏州越溪;1342-苏州越溪到上海浦东机场;1343-上海虹桥机场到苏州黎里;1344-昆山02到上海浦东机场;1345-上海浦东机场到苏州横扇镇;1346-上海虹桥机场到常熟三环内;1347-昆山03到上海浦东机场;1348-上海浦东机场到苏州吴江市区07;1349-上海浦东机场到苏州望亭;1350-上海浦东机场到昆山花桥;1351-上海浦东机场到甪直03;1352-苏州横扇镇到上海浦东机场;1353-苏州平望到上海浦东机场;1354-昆山花桥到上海浦东机场;1355-吴江市区07到上海浦东机场;1356-上海浦东机场到苏州黎里;1357-上海浦东机场到苏州盛泽;1358-甪直03到上海浦东机场;1359-上海浦东机场到昆山张浦;1360-苏州黎里到上海浦东机场;1361-上海浦东机场到昆山02;1362-昆山04到上海虹桥机场;1363-上海浦东机场到常熟三环内;1364-上海浦东机场到昆山03;1365-昆山04到上海浦东机场;1366-测试;1367-上海浦东机场到苏州平望;1368-黄浦-虹桥接机;1369-上海虹桥机场到昆山张浦;1370-苏州盛泽到上海浦东机场;1371-宝山-虹桥送机;1372-昆山张浦到上海浦东机场;1373-常熟三环内到上海浦东机场;1374-虹口-虹桥接机;1375-奉贤-虹桥接机;1376-测试2;1377-嘉定-虹桥送机;1378-虹口-虹桥送机;1379-昆山张浦到上海虹桥机场;1380-金山-虹桥接机;1381-金山-虹桥送机;1382-上海虹桥机场到昆山04;1383-七宝-虹桥接机;1384-静安-虹桥接机;1385-上海浦东机场到昆山04;1386-虹桥镇-虹桥接机;1387-闵行-虹桥接机;1388-黄浦-虹桥送机;1389-浦江-虹桥送机;1390-七宝-虹桥送机;1391-宝山-虹桥接机;1392-莘庄-虹桥送机;1393-虹桥镇-虹桥送机;1394-奉贤-虹桥送机;1395-陆家嘴-虹桥送机;1396-北蔡-虹桥接机;1397-嘉定-虹桥接机;1398-曹路-虹桥送机;1399-大团-虹桥送机;1400-静安-虹桥送机;1401-川沙-虹桥送机;1402-高行-虹桥接机;1403-闵行-虹桥送机;1404-大团-虹桥接机;1405-合庆-虹桥送机;1406-浦江-虹桥接机;1407-高桥-虹桥送机;1408-金桥-虹桥接机;1409-莘庄-虹桥接机;1410-航头-虹桥送机;1411-康桥-虹桥接机;1412-陆家嘴-虹桥接机;1413-合庆-虹桥接机;1414-三林-虹桥接机;1415-北蔡-虹桥送机;1416-新场-虹桥接机;1417-唐镇-虹桥接机;1418-曹路-虹桥接机;1419-张江-虹桥接机;1420-新场-虹桥送机;1421-川沙-虹桥接机;1422-周浦-虹桥接机;1423-宣桥-虹桥接机;1424-高行-虹桥送机;1425-祝桥-虹桥送机;1426-张江-虹桥送机;1427-高桥-虹桥接机;1428-普陀-虹桥送机;1429-周浦-虹桥送机;1430-航头虹桥接机;1431-青浦-虹桥送机;1432-松江-虹桥接机;1433-金桥-虹桥送机;1434-徐汇-虹桥送机;1435-九亭-虹桥接机;1436-康桥-虹桥送机;1437-宝山-浦机接机;1438-杨浦-虹桥接机;1439-三林-虹桥送机;1440-虹口-浦机接机;1441-长宁-虹桥接机;1442-唐镇-虹桥送机;1443-黄浦-浦机送机;1444-宝山-浦机送机;1445-宣桥-虹桥送机;1446-金山-浦机接机;1447-奉贤-浦机接机;1448-祝桥-虹桥接机;1449-闵行-浦机送机;1450-虹口-浦机送机;1451-普陀-虹桥接机;1452-浦江-浦机接机;1453-嘉定-浦机接机;1454-青浦-虹桥接机;1455-七宝-浦机送机;1456-金山-浦机送机;1457-松江-虹桥送机;1458-莘庄-浦机送机;1459-静安-浦机接机;1460-九亭-虹桥送机;1461-大团-浦机接机;1462-虹桥镇-浦机接机;1463-徐汇-虹桥接机;1464-高行-浦机接机;1465-浦江-浦机送机;1466-杨浦-虹桥送机;1467-航头-浦机接机;1468-北蔡-浦机接机;1469-长宁-虹桥送机;1470-金桥-浦机接机;1471-大团-浦机送机;1472-奉贤-浦机送机;1473-陆家嘴-浦机接机;1474-高行-浦机送机;1475-黄浦-浦机接机;1476-宣桥-浦机接机;1477-高桥-浦机接机;1478-嘉定-浦机送机;1479-张江-浦机送机;1480-航头-浦机送机;1481-静安-浦机送机;1482-普陀-浦机送机;1483-金桥-浦机送机;1484-虹桥镇-浦机送机;1485-青浦-浦机接机;1486-康桥-浦机接机;1487-闵行-浦机接机;1488-徐汇-浦机接机;1489-陆家嘴-浦机送机;1490-七宝-浦机接机;1491-长宁-浦机送机;1492-三林-浦机接机;1493-莘庄-浦机接机;1495-新场-浦机接机;1496-北蔡-浦机送机;1498-宣桥-浦机送机;1499-高桥-浦机送机;1501-周浦-浦机接机;1502-康桥-浦机送机;1504-青浦-浦机送机;1505-三林-浦机送机;1507-九亭-浦机接机;1508-新场-浦机送机;1510-松江-浦机接机;1511-张江-浦机接机;1513-徐汇-浦机送机;1514-周浦-浦机送机;1516-杨浦-浦机接机;1517-普陀-浦机接机;1520-九亭-浦机送机;1523-松江-浦机送机;1526-杨浦-浦机送机;1529-长宁-浦机接机;";
        
        String[] lineStrs=lineStr.split(";");
        
        Map<String,String> lineMap=new HashMap<String,String>();
        for(String line : lineStrs){
        	lineMap.put(line.split("-")[0], line.split("-")[1]);
        }
        
        List<Object> list = ExcelImportUtil.importExcel("F:/qu/test.xlsx", TestDTO.class);
        System.out.println(list.size());
        System.out.println(lineMap.size());*/
    	
    	Long.valueOf(null);
    	
    	String b="222";
    	//changeSt(b);
    	System.out.println(new Date(1553675066));
    }
    
    public static void  changeSt(String a){
    	a="111";
    }

}
